OpenFOAM-dev/tutorials/multiphaseEuler/wallBoilingIATE/system/functions
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format          ascii;
    class           dictionary;
    location        "system";
    object          functions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

writeWallBoilingProperties
{
    type            wallBoilingProperties;
    libs            ( "libmultiphaseEulerFunctionObjects.so" );
    writeControl    writeTime;
    phase           liquid;
}
outflow
{
    type            surfaceFieldValue;
    libs            ( "libfieldFunctionObjects.so" );
    log             yes;
    writeFields     false;
    select          patch;
    patch           outlet;
    operation       sum;
    fields          ( alphaRhoPhi.gas  alphaRhoPhi.liquid);
}
inflow
{
    type            surfaceFieldValue;
    libs            ( "libfieldFunctionObjects.so" );
    log             yes;
    writeFields     false;
    select          patch;
    patch           inlet;
    operation       sum;
    fields          ( alphaRhoPhi.gas alphaRhoPhi.liquid);
}
outletGas
{
    type            surfaceFieldValue;
    libs            ( "libfieldFunctionObjects.so" );
    log             yes;
    writeFields     false;
    select          patch;
    patch           outlet;
    operation       sum;
    weightField     alphaRhoPhi.gas;
    fields          ( h.gas );
}
outletLiquid
{
    type            surfaceFieldValue;
    libs            ( "libfieldFunctionObjects.so" );
    log             yes;
    writeFields     false;
    select          patch;
    patch           outlet;
    operation       sum;
    weightField     alphaRhoPhi.liquid;
    fields          ( h.liquid );
}
inletGas
{
    type            surfaceFieldValue;
    libs            ( "libfieldFunctionObjects.so" );
    log             yes;
    writeFields     false;
    select          patch;
    patch           inlet;
    operation       sum;
    weightField     alphaRhoPhi.gas;
    fields          ( h.gas );
}
inletLiquid
{
    type            surfaceFieldValue;
    libs            ( "libfieldFunctionObjects.so" );
    log             yes;
    writeFields     false;
    select          patch;
    patch           inlet;
    operation       sum;
    weightField     alphaRhoPhi.liquid;
    fields          ( h.liquid );
}
#includeFunc writeObjects(d.gas)

// ************************************************************************* //
